================================================================================
empty
================================================================================

--------------------------------------------------------------------------------

(source_file)

================================================================================
assignment
================================================================================

foo := "abc"

--------------------------------------------------------------------------------

(source_file
  (item
    (assignment
      (identifier)
      (expression
        (value
          (string_literal))))))

================================================================================
expression
================================================================================

foo := "abc" + 'def'

--------------------------------------------------------------------------------

(source_file
  (item
    (assignment
      (identifier)
      (expression
        (value
          (string_literal))
        (value
          (string_literal))))))

================================================================================
paths
================================================================================

relative := "abc" / 'def'
absolute := / "abc"
combined := "foo" / bar() / baz

--------------------------------------------------------------------------------

(source_file
  (item
    (assignment
      (identifier)
      (expression
        (value
          (string_literal))
        (value
          (string_literal)))))
  (item
    (assignment
      (identifier)
      (expression
        (value
          (string_literal)))))
  (item
    (assignment
      (identifier)
      (expression
        (value
          (string_literal))
        (value
          (function_call
            (identifier)))
        (value
          (identifier))))))

================================================================================
basic strings
================================================================================

foo := "a"
bar := "b
  c
"
baz := "a\"\t"

--------------------------------------------------------------------------------

(source_file
  (item
    (assignment
      (identifier)
      (expression
        (value
          (string_literal)))))
  (item
    (assignment
      (identifier)
      (expression
        (value
          (string_literal)))))
  (item
    (assignment
      (identifier)
      (expression
        (value
          (string_literal
            (escape_sequence)
            (escape_sequence)))))))

================================================================================
escape newlines
================================================================================

foo := "a\
b"

--------------------------------------------------------------------------------

(source_file
  (item
    (assignment
      (identifier)
      (expression
        (value
          (string_literal
            (escape_sequence)))))))

================================================================================
indented basic strings
================================================================================

foo := """a"""
bar:= """b
  c
"""
baz := """
abc \t
def \"
"""

--------------------------------------------------------------------------------

(source_file
  (item
    (assignment
      (identifier)
      (expression
        (value
          (string_literal)))))
  (item
    (assignment
      (identifier)
      (expression
        (value
          (string_literal)))))
  (item
    (assignment
      (identifier)
      (expression
        (value
          (string_literal
            (escape_sequence)
            (escape_sequence)))))))

================================================================================
raw strings
================================================================================

foo := 'a'
bar := 'b
  c
'
baz := 'a\"\t'

--------------------------------------------------------------------------------

(source_file
  (item
    (assignment
      (identifier)
      (expression
        (value
          (string_literal)))))
  (item
    (assignment
      (identifier)
      (expression
        (value
          (string_literal)))))
  (item
    (assignment
      (identifier)
      (expression
        (value
          (string_literal))))))

================================================================================
indented raw strings
================================================================================

foo := '''a'''
bar:= '''b
  c
'''
  baz := ''''
  abc \t
  def \"
'''

--------------------------------------------------------------------------------

(source_file
  (item
    (assignment
      (identifier)
      (expression
        (value
          (string_literal)))))
  (item
    (assignment
      (identifier)
      (expression
        (value
          (string_literal)))))
  (item
    (assignment
      (identifier)
      (expression
        (value
          (string_literal))))))

================================================================================
backticks
================================================================================

foo := `echo hi`
bar := `echo hi
  echo bye
`

--------------------------------------------------------------------------------

(source_file
  (item
    (assignment
      (identifier)
      (expression
        (value
          (external_command)))))
  (item
    (assignment
      (identifier)
      (expression
        (value
          (external_command))))))

================================================================================
indented backticks
================================================================================

foo := ```echo hi```
bar := ```
echo bye  
```
--------------------------------------------------------------------------------

(source_file
  (item
    (assignment
      (identifier)
      (expression
        (value
          (external_command)))))
  (item
    (assignment
      (identifier)
      (expression
        (value
          (external_command))))))

================================================================================
if
================================================================================

foo := if bar == baz { qux } else { quux }

--------------------------------------------------------------------------------

(source_file
  (item
    (assignment
      (identifier)
      (expression
        (if_expression
          (condition
            (expression
              (value
                (identifier)))
            (expression
              (value
                (identifier))))
          (expression
            (value
              (identifier)))
          (expression
            (value
              (identifier))))))))

================================================================================
else if
================================================================================

foo := if a == "x" {
  "val"
} else if "1" != "2" {
  foo_fn("val")
} else if "3" == "4" {
  if some_bool { val }
} else { val }

--------------------------------------------------------------------------------

(source_file
  (item
    (assignment
      (identifier)
      (expression
        (if_expression
          (condition
            (expression
              (value
                (identifier)))
            (expression
              (value
                (string_literal))))
          (expression
            (value
              (string_literal)))
          (condition
            (expression
              (value
                (string_literal)))
            (expression
              (value
                (string_literal))))
          (expression
            (value
              (function_call
                (identifier)
                (sequence
                  (expression
                    (value
                      (string_literal)))))))
          (condition
            (expression
              (value
                (string_literal)))
            (expression
              (value
                (string_literal))))
          (expression
            (if_expression
              (condition
                (expression
                  (value
                    (identifier))))
              (expression
                (value
                  (identifier)))))
          (expression
            (value
              (identifier))))))))

================================================================================
function
================================================================================

foo := some_fn("param1", param2)

--------------------------------------------------------------------------------

(source_file
  (item
    (assignment
      (identifier)
      (expression
        (value
          (function_call
            (identifier)
            (sequence
              (expression
                (value
                  (string_literal)))
              (expression
                (value
                  (identifier))))))))))

================================================================================
export
================================================================================

export foo := "abc"

--------------------------------------------------------------------------------

(source_file
  (item
    (export
      (assignment
        (identifier)
        (expression
          (value
            (string_literal)))))))

================================================================================
import
================================================================================

import 'foo/bar.just'
import? 'baz.just'

--------------------------------------------------------------------------------

(source_file
  (item
    (import
      (string_literal)))
  (item
    (import
      (string_literal))))

================================================================================
modules
================================================================================

mod foo
mod bar 'PATH'
mod? baz
mod? qux "PATH"

--------------------------------------------------------------------------------

(source_file
  (item
    (module
      (identifier)))
  (item
    (module
      (identifier)
      (string_literal)))
  (item
    (module
      (identifier)))
  (item
    (module
      (identifier)
      (string_literal))))

================================================================================
set
================================================================================

set SOME_BOOL
set FOO := true
set dotenv-load
set tempdir := "/tmp/just"
set shell := ["powershell.exe", "-c"]

--------------------------------------------------------------------------------

(source_file
  (item
    (setting
      (identifier)))
  (item
    (setting
      (identifier)
      (boolean)))
  (item
    (setting
      (identifier)))
  (item
    (setting
      (identifier)
      (string_literal)))
  (item
    (setting
      (string_literal)
      (string_literal))))

================================================================================
comment
================================================================================

# comment
foo := bar # + baz

--------------------------------------------------------------------------------

(source_file
  (comment)
  (item
    (assignment
      (identifier)
      (expression
        (value
          (identifier)))
      (comment))))

================================================================================
shebang
================================================================================

#!/usr/bin/env just

foo:
  body

--------------------------------------------------------------------------------

(source_file
  (shebang)
  (item
    (recipe
      (recipe_header
        (identifier))
      (recipe_body
        (recipe_line
          (text))))))
